<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $permissions = [
            'الأماكن',
            //الدول
            'عرض الدول',
            'إضافة الدول',
            'تعديل الدول',
            'حذف الدول',
            //المدن
            'عرض المدن',
            'إضافة المدن',
            'تعديل المدن',
            'حذف المدن',
            //المناطق
            'عرض المناطق',
            'إضافة المناطق',
            'تعديل المناطق',
            'حذف المناطق',



            'بيانات جهات الإتصال',
            //مصادر جهات الإتصال
            'عرض مصادر جهات الإتصال',
            'إضافة مصادر جهات الإتصال',
            'تعديل مصادر جهات الإتصال',
            'حذف مصادر جهات الإتصال',
            //فئات جهات الإتصال
            'عرض فئات جهات الإتصال',
            'إضافة فئات جهات الإتصال',
            'تعديل فئات جهات الإتصال',
            'حذف فئات جهات الإتصال',



            'بيانات الأنشطة',
            //الأنشطة الرئيسية
            'عرض الأنشطة الرئيسية',
            'إضافة الأنشطة الرئيسية',
            'تعديل الأنشطة الرئيسية',
            'حذف الأنشطة الرئيسية',
            //الأنشطة الفرعية
            'عرض الأنشطة الفرعية',
            'إضافة الأنشطة الفرعية',
            'تعديل الأنشطة الفرعية',
            'حذف الأنشطة الفرعية',




            //قطاعات الأعمال
            'عرض قطاعات الأعمال',
            'إضافة قطاعات الأعمال',
            'تعديل قطاعات الأعمال',
            'حذف قطاعات الأعمال',
            //التخصصات
            'عرض التخصصات',
            'إضافة التخصصات',
            'تعديل التخصصات',
            'حذف التخصصات',
            //المسميات الوظيفية
            'عرض المسميات الوظيفية',
            'إضافة المسميات الوظيفية',
            'تعديل المسميات الوظيفية',
            'حذف المسميات الوظيفية',
            //الردود المحفوظة
            'عرض الردود المحفوظة',
            'إضافة الردود المحفوظة',
            'تعديل الردود المحفوظة',
            'حذف الردود المحفوظة',
            //تارجت الموظفين
            'عرض تارجت الموظفين',
            'إضافة تارجت الموظفين',
            'تعديل تارجت الموظفين',
            'حذف تارجت الموظفين',



            'إدارة علاقات العملاء',
            //جهات الإتصال
            'عرض جهات الإتصال',
            'إضافة جهات الإتصال',
            'تعديل جهات الإتصال',
            'حذف جهات الإتصال',
            'أرشفة جهات الإتصال',
            'تصدير جهات الإتصال',
            'إستيراد جهات الإتصال',
            'تغيير حالات تنشيط جهات الإتصال',
            'إرسال رسائل جهات الإتصال',
            'إضافة مكالمات جهات الإتصال',
            //العملاء
            'عرض العملاء',
            'إضافة العملاء',
            'تعديل العملاء',
            'حذف العملاء',
            'إستيراد العملاء',
            'إضافة فواتير العملاء',
            'تعديل فواتير العملاء',
            'إضافة تذكيرات العملاء',
            'إضافة إعادة إستهداف العملاء',
            'إضافة عملاء مرتبط العملاء',



            'التسويق',
            //الحملات
            'عرض الحملات',
            'إضافة الحملات',
            'تعديل الحملات',
            'حذف الحملات',
            //أنظمة النقاط
            'عرض أنظمة النقاط',
            'إضافة أنظمة النقاط',
            'تعديل أنظمة النقاط',
            'حذف أنظمة النقاط',



            'التقارير',
            //تقارير المكالمات والزيارات
            'عرض تقارير المكالمات والزيارات',
            //تقارير جهات الإتصال
            'عرض تقارير جهات الإتصال',
            //تقارير مبيعات الموظفين
            'عرض تقارير مبيعات الموظفين',
            //تقارير مبيعات الفروع
            'عرض تقارير مبيعات الفروع',
            //تقارير مبيعات الأنشظة
            'عرض تقارير مبيعات الأنشظة',



            'التنبيهات',
            //تذكيرات اليوم
            'عرض تذكيرات اليوم',
            //تذكيرات الشهر
            'عرض تذكيرات الشهر',
            //الإشعارات
            'عرض الإشعارات',
            'إضافة الإشعارات',
            'تعديل الإشعارات',
            'حذف الإشعارات',



            'الفريق',
            //الفروع
            'عرض الفروع',
            'إضافة الفروع',
            'تعديل الفروع',
            'حذف الفروع',
            //الأقسام
            'عرض الأقسام',
            'إضافة الأقسام',
            'تعديل الأقسام',
            'حذف الأقسام',
            //الصلاحيات
            'عرض الصلاحيات',
            'إضافة الصلاحيات',
            'تعديل الصلاحيات',
            'حذف الصلاحيات',
            //المستخدمين
            'عرض المستخدمين',
            'إضافة المستخدمين',
            'تعديل المستخدمين',
            'حذف المستخدمين',
        ];



        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
        }
    }
}
